{"loss_weights": null, "optimizer": {"epsilon": 1e-08, "beta_2": 0.9990000128746033, "name": "Adam", "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421}, "config": {"input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1", "output_layers": [["similarity", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 128], "name": "input_1", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [], "name": "input_2", "config": {"batch_input_shape": [null, 128], "name": "input_2", "input_dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0], ["input_2", 0, 0]]], "name": "merge", "config": {"concat_axis": -1, "mode": "concat", "name": "merge", "dot_axes": [-1, -1], "output_shape": null, "mode_type": "raw", "output_shape_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge", 0, 0]]], "name": "dense1", "config": {"trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 128, "W_constraint": null, "name": "dense1", "activation": "relu", "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense1", 0, 0]]], "name": "batchnormalization_1", "config": {"trainable": true, "epsilon": 1e-06, "name": "batchnormalization_1", "momentum": 0.9, "mode": 2, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "dense2", "config": {"trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 64, "W_constraint": null, "name": "dense2", "activation": "relu", "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense2", 0, 0]]], "name": "batchnormalization_2", "config": {"trainable": true, "epsilon": 1e-06, "name": "batchnormalization_2", "momentum": 0.9, "mode": 2, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "dense3", "config": {"trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 32, "W_constraint": null, "name": "dense3", "activation": "relu", "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense3", 0, 0]]], "name": "batchnormalization_3", "config": {"trainable": true, "epsilon": 1e-06, "name": "batchnormalization_3", "momentum": 0.9, "mode": 2, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "dense4", "config": {"trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 16, "W_constraint": null, "name": "dense4", "activation": "relu", "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense4", 0, 0]]], "name": "batchnormalization_4", "config": {"trainable": true, "epsilon": 1e-06, "name": "batchnormalization_4", "momentum": 0.9, "mode": 2, "axis": -1}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "similarity", "config": {"trainable": true, "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 1, "W_constraint": null, "name": "similarity", "activation": "sigmoid", "bias": true, "activity_regularizer": null}, "class_name": "Dense"}]}, "loss": "binary_crossentropy", "sample_weight_mode": null, "keras_version": "1.0.6", "class_name": "Model"}